## Les fonctions on va apprendre:
- df[Object]
- df.iloc[] df.loc[]
- pd.to_datetime(col) 
- df.set_index()

#### Opération d'index DataFrame :
- indexer la ligne
- indexer la colonne
- indexer l'élément

In [1]:
import numpy as np
from pandas import DataFrame
df = DataFrame(data=np.random.randint(60,100,size=(8,4)),columns=['a','b','c','d'])
df

    a   b   c   d
0  66  89  88  84
1  99  60  83  85
2  65  69  73  96
3  75  91  69  77
4  71  79  97  97
5  96  71  67  64
6  68  85  68  98
7  71  86  71  78

In [2]:
df['a'] # Prendre la colone
#Seuls les index explicites peuvent être utilisés lors de la récupération de lignes ou de colonnes via le mécanisme d'index

0    66
1    99
2    65
3    75
4    71
5    96
6    68
7    71
Name: a, dtype: int64

In [3]:
df[['a','c']]

    a   c
0  66  88
1  99  83
2  65  73
3  75  69
4  71  97
5  96  67
6  68  68
7  71  71

In [4]:
df.iloc[0] # Prendre l'index de ligne implicite

a    66
b    89
c    88
d    84
Name: 0, dtype: int64

In [5]:
df.loc[0,'c'] # Récupérer l'index de ligne explicite

88

Opération de découpage de DataFrame :
- Trancher la ligne
- Trancher la colonne

In [6]:
#Trancher la ligne
df[0:2]

    a   b   c   d
0  66  89  88  84
1  99  60  83  85

In [7]:
#Trancher la colonee
df.iloc[:,0:2]

    a   b
0  66  89
1  99  60
2  65  69
3  75  91
4  71  79
5  96  71
6  68  85
7  71  86

In [8]:
df.loc[:,'a':'b']

    a   b
0  66  89
1  99  60
2  65  69
3  75  91
4  71  79
5  96  71
6  68  85
7  71  86

### Résumé:
#### index : 
- df[col] : récupérer la colonne
- df.loc[index] : obtenir la ligne
- df.iloc[index, col] : prendre des éléments
#### tranche:
- df[index1:index3] : coupe les lignes
- df.iloc[:,col1:col3] : coupe les colonnes

#### Opérations DataFrame :
- Identique à la série

### Exercice
- En supposant que ddd est la note de l'examen de mi-session et que ddd2 est la note de l'examen final, veuillez créer ddd2 librement et l'ajouter à ddd pour trouver la moyenne à la fin de la mi-session.

In [9]:
dic = {
    "amanda" : [150,150,150,150],
    "lilly" : [130,120,110,100]
}

df = DataFrame(data=dic,index=['Language','Math','Anglais','Science'])
df

          amanda  lilly
Language     150    130
Math         150    120
Anglais      150    110
Science      150    100

In [10]:
ddd = df-10
ddd2 = df
moy = (ddd + ddd2)/2

In [11]:
moy

          amanda  lilly
Language   145.0  125.0
Math       145.0  115.0
Anglais    145.0  105.0
Science    145.0   95.0

- Supposons qu'Amanda se soit avérée avoir triché au test de mathématiques à mi-parcours et devrait être enregistrée comme 0 point, comment y parvenir ?

In [12]:
ddd.loc['Math','amanda']

140

In [13]:
ddd.loc['Math','amanda'] = 0

In [14]:
ddd

          amanda  lilly
Language     140    120
Math           0    110
Anglais      140    100
Science      140     90

In [15]:
moy = (ddd + ddd2)/2
moy

          amanda  lilly
Language   145.0  125.0
Math        75.0  115.0
Anglais    145.0  105.0
Science    145.0   95.0

- Étant donné que Lilly a signalé qu'Amanda avait triché et rendu des services méritoires, 10 points seront ajoutés à toutes les matières de l'examen de mi-session. Comment y parvenir ?

In [16]:
ddd['lilly']

Language    120
Math        110
Anglais     100
Science      90
Name: lilly, dtype: int64

In [17]:
ddd['lilly']+=10

In [18]:
ddd

          amanda  lilly
Language     140    130
Math           0    120
Anglais      140    110
Science      140    100

- Plus tard, l'enseignant a découvert qu'il y avait une erreur dans l'une des questions. Afin d'apaiser les élèves, il a donné à chaque élève 5 points pour chaque matière. Comment y parvenir ?

In [19]:
ddd += 5
ddd

          amanda  lilly
Language     145    135
Math           5    125
Anglais      145    115
Science      145    105

In [20]:
moy = (ddd+ddd2)/2
moy

          amanda  lilly
Language   147.5  132.5
Math        77.5  122.5
Anglais    147.5  112.5
Science    147.5  102.5

#### Conversion des types de données temporelles :
- pd.to_datetime(col) <br>

#### Définir une colonne comme index de ligne :
- df.set_index() <br>

In [21]:
dic = {
    'time' : ['2023-06-27','2023-05-28','2023-11-09'],
    'temp' : [33,31,29]
}

df = DataFrame(data = dic)
df

         time  temp
0  2023-06-27    33
1  2023-05-28    31
2  2023-11-09    29

In [22]:
df['time']

0    2023-06-27
1    2023-05-28
2    2023-11-09
Name: time, dtype: object

In [23]:
# Afficher le type de valeur de temps
df['time'].dtype # 'O' --> string

dtype('O')

- Convertir le type de données de la colonne de temps en un type de série chronologique

In [24]:
import pandas as pd
df['time'] = pd.to_datetime(df['time'])

In [25]:
df

        time  temp
0 2023-06-27    33
1 2023-05-28    31
2 2023-11-09    29

In [26]:
df['time']

0   2023-06-27
1   2023-05-28
2   2023-11-09
Name: time, dtype: datetime64[ns]

- Utilisez 'time' comme index de ligne des données d'origine

In [27]:
df

        time  temp
0 2023-06-27    33
1 2023-05-28    31
2 2023-11-09    29

In [28]:
df.set_index('time')

            temp
time
2023-06-27    33
2023-05-28    31
2023-11-09    29

In [29]:
df

        time  temp
0 2023-06-27    33
1 2023-05-28    31
2 2023-11-09    29

In [30]:
df.set_index('time',inplace = True) # Remplacer les données d'origine

In [31]:
df

            temp
time
2023-06-27    33
2023-05-28    31
2023-11-09    29